Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.instance_template.google_compute_instance_template.tpl must be replaced
+/- resource "google_compute_instance_template" "tpl" {
        can_ip_forward       = false
      ~ id                   = "projects/ps-workspace/global/instanceTemplates/default-instance-template-20220406213209151200000001" -> (known after apply)
        machine_type         = "n1-standard-1"
      - metadata             = {} -> null
      ~ metadata_fingerprint = "YEy1dZ5SWkU=" -> (known after apply)
      ~ name                 = "default-instance-template-20220406213209151200000001" -> (known after apply)
        name_prefix          = "default-instance-template-"
        project              = "ps-workspace"
        region               = "us-west2"
      ~ self_link            = "https://www.googleapis.com/compute/beta/projects/ps-workspace/global/instanceTemplates/default-instance-template-20220406213209151200000001" -> (known after apply)
        tags                 = [
            "ps-workspace-firewall-dev-gloml",
        ]
      + tags_fingerprint     = (known after apply)

      ~ advanced_machine_features {
            enable_nested_virtualization = false
          - threads_per_core             = 0 -> null
        }

        confidential_instance_config {
            enable_confidential_compute = false
        }

      ~ disk {
            auto_delete       = true
            boot              = true
          ~ device_name       = "persistent-disk-0" -> (known after apply)
            disk_size_gb      = 50
            disk_type         = "pd-standard"
          ~ interface         = "SCSI" -> (known after apply)
          - labels            = {} -> null
          ~ mode              = "READ_WRITE" -> (known after apply)
          - resource_policies = [] -> null
          ~ source_image      = "projects/ubuntu-os-cloud/global/images/family/ubuntu-1804-lts" -> "ubuntu-os-cloud/ubuntu-2004-lts" # forces replacement
            type              = "PERSISTENT"
        }

      ~ network_interface {
          + ipv6_access_type   = (known after apply)
          ~ name               = "nic0" -> (known after apply)
            network            = "https://www.googleapis.com/compute/v1/projects/ps-workspace/global/networks/ps-workspace-network-dev-gloml-network"
          + stack_type         = (known after apply)
            subnetwork         = "https://www.googleapis.com/compute/v1/projects/ps-workspace/regions/us-west2/subnetworks/ps-workspace-network-dev-gloml-subnetwork-public"
          ~ subnetwork_project = "ps-workspace" -> (known after apply)
        }

      ~ scheduling {
            automatic_restart   = true
          - min_node_cpus       = 0 -> null
            on_host_maintenance = "MIGRATE"
            preemptible         = false
        }

        service_account {
            email  = "tobi-lab-sa@ps-workspace.iam.gserviceaccount.com"
            scopes = [
                "https://www.googleapis.com/auth/compute.readonly",
                "https://www.googleapis.com/auth/devstorage.read_only",
                "https://www.googleapis.com/auth/userinfo.email",
            ]
        }
    }

  # module.vm.data.google_compute_zones.available will be read during apply
  # (config refers to values not yet known)
 <= data "google_compute_zones" "available"  {
      ~ id      = "projects/ps-workspace/regions/us-west2" -> (known after apply)
      ~ names   = [
          - "us-west2-a",
          - "us-west2-b",
          - "us-west2-c",
        ] -> (known after apply)
      ~ project = "ps-workspace" -> (known after apply)
        region  = "us-west2"
    }

  # module.vm.google_compute_instance_from_template.compute_instance[0] must be replaced
-/+ resource "google_compute_instance_from_template" "compute_instance" {
      + allow_stopping_for_update = (known after apply)
      ~ attached_disk             = [] -> (known after apply)
      ~ can_ip_forward            = false -> (known after apply)
      ~ cpu_platform              = "Intel Skylake" -> (known after apply)
      ~ current_status            = "RUNNING" -> (known after apply)
      ~ deletion_protection       = false -> (known after apply)
      + description               = (known after apply)
      + desired_status            = (known after apply)
      ~ enable_display            = false -> (known after apply)
      ~ guest_accelerator         = [] -> (known after apply)
      + hostname                  = (known after apply)
      ~ id                        = "projects/ps-workspace/zones/us-west2-a/instances/ps-workspace-bastion-dev-gloml-001" -> (known after apply)
      ~ instance_id               = "2114544262780794881" -> (known after apply)
      ~ label_fingerprint         = "42WmSpB8rSM=" -> (known after apply)
      ~ labels                    = {} -> (known after apply)
      ~ machine_type              = "n1-standard-1" -> (known after apply)
      ~ metadata                  = {} -> (known after apply)
      ~ metadata_fingerprint      = "YEy1dZ5SWkU=" -> (known after apply)
      + metadata_startup_script   = (known after apply)
      + min_cpu_platform          = (known after apply)
        name                      = "ps-workspace-bastion-dev-gloml-001"
      ~ project                   = "ps-workspace" -> (known after apply) # forces replacement
      ~ resource_policies         = [] -> (known after apply)
      ~ scratch_disk              = [] -> (known after apply)
      ~ self_link                 = "https://www.googleapis.com/compute/v1/projects/ps-workspace/zones/us-west2-a/instances/ps-workspace-bastion-dev-gloml-001" -> (known after apply)
      ~ service_account           = [
          - {
              - email  = "tobi-lab-sa@ps-workspace.iam.gserviceaccount.com"
              - scopes = [
                  - "https://www.googleapis.com/auth/compute.readonly",
                  - "https://www.googleapis.com/auth/devstorage.read_only",
                  - "https://www.googleapis.com/auth/userinfo.email",
                ]
            },
        ] -> (known after apply)
      ~ source_instance_template  = "https://www.googleapis.com/compute/beta/projects/ps-workspace/global/instanceTemplates/default-instance-template-20220406213209151200000001" -> (known after apply) # forces replacement
      ~ tags                      = [
          - "ps-workspace-firewall-dev-gloml",
        ] -> (known after apply)
      ~ tags_fingerprint          = "NNDLGEEhcEc=" -> (known after apply)
      ~ zone                      = "us-west2-a" -> (known after apply) # forces replacement

      ~ advanced_machine_features {
          ~ enable_nested_virtualization = false -> (known after apply)
          ~ threads_per_core             = 0 -> (known after apply)
        }

      ~ boot_disk {
          ~ auto_delete                = true -> (known after apply)
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_raw    = (sensitive value)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ mode                       = "READ_WRITE" -> (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/ps-workspace/zones/us-west2-a/disks/ps-workspace-bastion-dev-gloml-001" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20220331a" -> (known after apply)
              ~ labels = {} -> (known after apply)
              ~ size   = 50 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ confidential_instance_config {
          ~ enable_confidential_compute = false -> (known after apply)
        }

      ~ network_interface {
          ~ access_config      = [
              ~ {
                  ~ nat_ip                 = "34.94.83.137" -> (known after apply)
                    network_tier           = "PREMIUM"
                  ~ public_ptr_domain_name = "" -> (known after apply)
                },
            ]
          ~ alias_ip_range     = [] -> (known after apply)
          + ipv6_access_type   = (known after apply)
          ~ name               = "nic0" -> (known after apply)
            network            = "https://www.googleapis.com/compute/v1/projects/ps-workspace/global/networks/ps-workspace-network-dev-gloml-network"
          ~ network_ip         = "10.6.0.4" -> (known after apply)
          + nic_type           = (known after apply)
          ~ stack_type         = "IPV4_ONLY" -> (known after apply)
            subnetwork         = "https://www.googleapis.com/compute/v1/projects/ps-workspace/regions/us-west2/subnetworks/ps-workspace-network-dev-gloml-subnetwork-public"
          ~ subnetwork_project = "ps-workspace" -> (known after apply)

          + ipv6_access_config {
              + external_ipv6               = (known after apply)
              + external_ipv6_prefix_length = (known after apply)
              + network_tier                = (known after apply)
              + public_ptr_domain_name      = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ min_node_cpus       = 0 -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://modern-ape-65.loca.lt/events/lock?id=nerdeveloper%252Fhashitalks-2022%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 2 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
